{
  "makeStudioFields": true,
  "version": 1,
  "description": "Bio with portrait",
  "fields": [
    {
      "type": "text",
      "name": "Headline",
      "default": "I'm Spencer Sharp. I live in New York City, where I design the future."
    },
    {
      "type": "wysiwyg",
      "name": "Bio",
      "default": "<p>I've loved making things for as long as I can remember, and wrote my first program when I was 6 years old, just two weeks after my mom brought home the brand new Macintosh LC 550 that I taught myself to type on.</p><p>The only thing I loved more than computers as a kid was space. When I was 8, I climbed the 40-foot oak tree at the back of our yard while wearing my older sister's motorcycle helmet, counted down from three, and jumped — hoping the tree was tall enough that with just a bit of momentum I'd be able to get to orbit.</p><p>I spent the next few summers indoors working on a rocket design, while I recovered from the multiple surgeries it took to fix my badly broken legs. It took nine iterations, but when I was 15 I sent my dad's Blackberry into orbit and was able to transmit a photo back down to our family computer from space.</p><p>Today, I'm the founder of Planetaria, where we're working on civilian space suits and manned shuttle kits you can assemble at home so that the next generation of kids really <em>can</em> make it to orbit — from the comfort of their own backyards.</p>"
    },
    {
      "type": "image",
      "name": "Portrait",
      "default": "https://images.unsplash.com/photo-1472099645785-5658abf4ff4e?w=800&h=800&fit=crop&crop=face",
      "config": {
        "maxWidth": 3000,
        "maxHeight": 3000,
        "fileType": "",
        "fileQuality": "0.8"
      }
    },
    {
      "type": "items",
      "name": "Social Links",
      "default": [
        { "label": "Follow on X", "url": "#", "icon": "x-logo" },
        { "label": "Follow on Instagram", "url": "#", "icon": "instagram-logo" },
        { "label": "Follow on GitHub", "url": "#", "icon": "github-logo" },
        { "label": "Follow on LinkedIn", "url": "#", "icon": "linkedin-logo" }
      ],
      "config": {
        "fields": [
          { "type": "text", "name": "Label" },
          { "type": "text", "name": "URL" },
          { "type": "text", "name": "Icon" }
        ]
      }
    },
    {
      "type": "text",
      "name": "Email",
      "default": "spencer@planetaria.tech"
    }
  ]
}
