{
  "makeStudioFields": true,
  "version": 1,
  "description": "Grouped recommendations",
  "fields": [
    {
      "type": "text",
      "name": "Headline",
      "default": "Software I use, gadgets I love, and other things I recommend."
    },
    {
      "type": "textarea",
      "name": "Subheadline",
      "default": "I get asked a lot about the things I use to build software, stay productive, or buy to fool myself into thinking I'm being productive when I'm really just procrastinating. Here's a big list of all of my favorite stuff."
    },
    {
      "type": "items",
      "name": "Sections",
      "default": [
        {
          "title": "Workstation",
          "tools": [
            { "title": "16\" MacBook Pro, M1 Max, 64GB RAM (2021)", "description": "I was using an Intel-based 16\" MacBook Pro prior to this and the difference is night and day." },
            { "title": "Apple Pro Display XDR (Standard Glass)", "description": "The only display on the market if you want something HiDPI and bigger than 27\"." },
            { "title": "IBM Model M SSK Industrial Keyboard", "description": "They don't make keyboards the way they used to." }
          ]
        },
        {
          "title": "Development tools",
          "tools": [
            { "title": "Sublime Text 4", "description": "I don't care if it's missing all of the fancy IDE features everyone else relies on, Sublime Text is still the best text editor ever made." },
            { "title": "iTerm2", "description": "I'm honestly not even sure what features I get with this that aren't just part of the macOS Terminal but it's what I use." },
            { "title": "TablePlus", "description": "Great software for working with databases. Has saved me from building about a thousand admin interfaces." }
          ]
        },
        {
          "title": "Design",
          "tools": [
            { "title": "Figma", "description": "We started using Figma as just a design tool but now it's become our virtual whiteboard for the entire company." }
          ]
        },
        {
          "title": "Productivity",
          "tools": [
            { "title": "Alfred", "description": "It's not the newest kid on the block but it's still the fastest. The Sublime Text of the application launcher world." },
            { "title": "Reflect", "description": "Using a daily notes system instead of trying to keep things organized by topics has been super powerful for me." },
            { "title": "SavvyCal", "description": "Great tool for scheduling meetings while protecting my calendar and making sure I still have lots of time for deep work." },
            { "title": "Focus", "description": "Simple tool for blocking distracting websites when I need to just do the work and get some momentum going." }
          ]
        }
      ],
      "config": {
        "fields": [
          { "type": "text", "name": "Title" },
          {
            "type": "items",
            "name": "Tools",
            "config": {
              "fields": [
                { "type": "text", "name": "Title" },
                { "type": "text", "name": "Description" },
                { "type": "text", "name": "URL" }
              ]
            }
          }
        ]
      }
    }
  ]
}
